app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    permitted_columns = params.require(:article).permit(:title, :description)
    @article.update_attributes(permitted_columns)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-08 23:05:55.072297"], ["id", 1]]